<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","backend":"384aff2e886419075b9e3e8a02fe961dcc7e97472c4418cee82838965691a8cf","plan_job_ref":"Job Test terraform-refresh #38 at https://github.com/dflook/terraform-github-actions/actions/runs/15334321257","plan_out_hash":"5f636ca542b55d77ccc6688c881093ec89a757da50ab5c4f9aa7ae1adad08af3","plan_hash":"a849e416bdda8b7e8a692d55bcc23b0fe6b18334328be7bac9bcb10669d674d6","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-refresh__
:recycle: Skipping refresh of resource state
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # local_file.one will be created
+   resource "local_file" "one" {
+       content              = "this is my first file"
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0777"
+       file_permission      = "0777"
+       filename             = "test"
+       id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Test terraform-refresh #38](https://github.com/dflook/terraform-github-actions/actions/runs/15334321257)